# Написать скрипт, который меняет каждое число на квадрат данного числа
# Пример:
# [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]] - до
# #[[1, 4, 9, 16], [25, 36, 49, 64], [81, 100, 121, 144]] - после

my_list = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
my_list2 = [[num**2 for num in row ]for row in my_list]
print(my_list2)# Пример:

