# Написать скрипт, который переконвертирует строку в целочисленное
# Пример:
# ["12", "15", "16", "17"] до
# [12, 15, 16, 17] после
# Требование:
# Использовать list comprehension
my_list =  ["12", "15", "16", "17"]
my_list2 = [int(num)for num in my_list]
print(my_list2)
